openfoam/OpenFOAM-dev/tutorials/isothermalFluid/potentialFreeSurfaceMovingOscillatingBox/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forces
{
    type            forces;
    libs            ("libforces.so");
    writeControl    writeTime;
    patches         (floatingObject);
    rho             rhoInf;
    log             yes;
    rhoInf          1000;
    CofR            (0 0 0);
}

poolHeight
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");
    writeControl   timeStep;
    writeInterval  1;
    log             yes;
    writeTotalArea  no;
    writeFields     no;
    select          faceZone;
    faceZone        f0;
    operation       areaAverage;
    fields
    (
        zeta
    );
}

// ************************************************************************* //
